Tekla.Structures.Geometry3d.Polycurve
Represents 3D polycurve geometry, which itself is composed of one or more connected curves. The class offers
facilities for iteration through the polycurve, and implements the Tekla.Structures.Geometry3d.ICurve interface.
Once this class is constructed, it represents an immutable polycurve. The curves that can be obtained during
iteration are mere copies of the curves in the polycurve, and mutating them won't affect the polycurve. Please
use the Tekla.Structures.Geometry3d.PolycurveGeometryBuilder class to build and manipulate this objects of this class.
Since it implements System.Collections.IEnumerable, the curves can be iterated using foreach loops, and it supports
all of the LINQ operations, and it is possible to build arbitrarily complex queries over the curves of this
class.

Tekla.Structures.Geometry3d.Polycurve.StartPoint
Gets the start point of the polycurve

Tekla.Structures.Geometry3d.Polycurve.EndPoint
Gets the end point of the polycurve

Tekla.Structures.Geometry3d.Polycurve.Length
Gets the total length of the polycurve

Tekla.Structures.Geometry3d.Polycurve.Clone
Creates a deep copy of the polycurve
Returns: The copy

Tekla.Structures.Geometry3d.Polycurve.Equals(Tekla.Structures.Geometry3d.ICurve)
Determines whether the polycurve equals another polycurve
This function only checks for equality among polycurves
other: The other polycurve
Returns: True if equal, false otherwise

Tekla.Structures.Geometry3d.Polycurve.#ctor(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.ICurve})
Initializes a new instance of the Tekla.Structures.Geometry3d.Polycurve class from a list of geometries.
This offers high degree of control over the creation.
geometryList: List of geometries to be applied

Tekla.Structures.Geometry3d.Polycurve.#ctor
Initializes a new instance of the Tekla.Structures.Geometry3d.Polycurve class.

Tekla.Structures.Geometry3d.Polycurve.#ctor(Tekla.Structures.Geometry3d.ICurve)
Initializes a new instance of the Tekla.Structures.Geometry3d.Polycurve class from a curve geometry.
geometry: Initial geometry for the polycurve

Tekla.Structures.Geometry3d.Polycurve.#ctor(Tekla.Structures.Geometry3d.PolyLine)
Initializes a new instance of the Tekla.Structures.Geometry3d.Polycurve class from a Tekla.Structures.Geometry3d.PolyLine.
The lines are converted to line segments.
polyLine: Initial geometry for the geometry list

Tekla.Structures.Geometry3d.Polycurve.GetEnumerator
This method implements the IEnumerable interface
Returns: Enumerator of the geometry list

Tekla.Structures.Geometry3d.Polycurve.System#Collections#IEnumerable#GetEnumerator
Implements the IEnumerable interface
Returns: Enumerator of the geometry list